In [1]:
import numpy as np
import pandas as pd

In [2]:
raw_data= pd.read_csv(r'C:\DataScienceAndAICourse\february\15th,17th - Kaggle, Dt , time split\TASK\Mydata-Address.csv')

In [9]:
raw_data['Address']

0    No. 8-2-120/112,  Park View Estate, Banjara Hi...
1    Plot No.66, Park View Enclave, Jubilee Hills, ...
2    11-5-152/6 , Adams Umbrella Towers , Lakdikapu...
Name: Address, dtype: object

In [13]:
raw_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Address        3 non-null      object
 1   Date of Birth  3 non-null      object
dtypes: object(2)
memory usage: 180.0+ bytes

In [21]:
raw_data[['HNO' , 'Street' , 'locality' , 'city' , 'state' , 'pin code', 'country']] = raw_data['Address'].str.split(',',expand=True)

In [23]:
raw_data

,Address,Date of Birth,HNO,Street,locality,city,state,pin code,country
0,"No. 8-2-120/112, Park View Estate, Banjara Hi...",18.03.2001,No. 8-2-120/112,Park View Estate,Banjara Hills,Hyderabad,Telangana,500034,India
1,"Plot No.66, Park View Enclave, Jubilee Hills, ...",22.11.1990,Plot No.66,Park View Enclave,Jubilee Hills,Hyderabad,Telangana 500033,India,None
2,"11-5-152/6 , Adams Umbrella Towers , Lakdikapu...",11.08.1993,11-5-152/6,Adams Umbrella Towers,Lakdikapul,Hyderabad,Telangana,500004,India

In [25]:
raw_data['Date of Birth']

0    18.03.2001
1    22.11.1990
2    11.08.1993
Name: Date of Birth, dtype: object

In [27]:
raw_data['Date of Birth'].str.split('.')

0    [18, 03, 2001]
1    [22, 11, 1990]
2    [11, 08, 1993]
Name: Date of Birth, dtype: object

In [29]:
raw_data['Date of Birth'].str.split('.',expand=True)

    0   1     2
0  18  03  2001
1  22  11  1990
2  11  08  1993

In [31]:
raw_data[['Date','Month','Year']] = raw_data['Date of Birth'].str.split('.',expand=True)

In [33]:
raw_data

,Address,Date of Birth,HNO,Street,locality,city,state,pin code,country,Date,Month,Year
0,"No. 8-2-120/112, Park View Estate, Banjara Hi...",18.03.2001,No. 8-2-120/112,Park View Estate,Banjara Hills,Hyderabad,Telangana,500034,India,18,03,2001
1,"Plot No.66, Park View Enclave, Jubilee Hills, ...",22.11.1990,Plot No.66,Park View Enclave,Jubilee Hills,Hyderabad,Telangana 500033,India,None,22,11,1990
2,"11-5-152/6 , Adams Umbrella Towers , Lakdikapu...",11.08.1993,11-5-152/6,Adams Umbrella Towers,Lakdikapul,Hyderabad,Telangana,500004,India,11,08,1993

In [35]:
raw_data.to_csv(r'C:\DataScienceAndAICourse\february\15th,17th - Kaggle, Dt , time split\TASK\Cleaned-Address.csv')

In [37]:
cleaned_data = pd.read_csv(r'C:\DataScienceAndAICourse\february\15th,17th - Kaggle, Dt , time split\TASK\Cleaned-Address.csv')

In [39]:
cleaned_data

,Unnamed: 0,Address,Date of Birth,HNO,Street,locality,city,state,pin code,country,Date,Month,Year
0,0,"No. 8-2-120/112, Park View Estate, Banjara Hi...",18.03.2001,No. 8-2-120/112,Park View Estate,Banjara Hills,Hyderabad,Telangana,500034,India,18,3,2001
1,1,"Plot No.66, Park View Enclave, Jubilee Hills, ...",22.11.1990,Plot No.66,Park View Enclave,Jubilee Hills,Hyderabad,Telangana 500033,India,NaN,22,11,1990
2,2,"11-5-152/6 , Adams Umbrella Towers , Lakdikapu...",11.08.1993,11-5-152/6,Adams Umbrella Towers,Lakdikapul,Hyderabad,Telangana,500004,India,11,8,1993